@acwwat unfortunately I can't test at the moment that the pipeline actually works, but at least  I can confirm that Terraform is now allows to set both `RELEASE_NAME` and `TAG_NAME` and that they are correctly converted in valid `filter_group`

```terraform
  # module.pipeline_tag[0].aws_codebuild_webhook.webhook_tag will be created
  + resource "aws_codebuild_webhook" "webhook_tag" {
      + build_type   = "BUILD"
      + id           = (known after apply)
      + payload_url  = (known after apply)
      + project_name = "intelowl-prod"
      + secret       = (sensitive value)
      + url          = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "master"
              + type                    = "HEAD_REF"
            }
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "^([0-9.]+)$"
              + type                    = "RELEASE_NAME"
            }
        }
    }
```